mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1c1xb/common/s6e1c1xb.h
typedef struct stc_rtc_wtclks_field
{
        __IO   uint8_t  WTCLKS                   :1;
        __IO   uint8_t  RESERVED0                :7;
} stc_rtc_wtclks_field_t;

typedef struct stc_rtc_wtclkm_field
{
    union {
        struct {
            __IO   uint8_t  WTCLKM               :2;
            __IO   uint8_t  RESERVED0            :6;
        };
        struct {
            __IO   uint8_t  WTCLKM0              :1;
            __IO   uint8_t  WTCLKM1              :1;
            __IO   uint8_t  RESERVED1            :6;
        };
    };
} stc_rtc_wtclkm_field_t;

typedef struct stc_rtc_wtcal_field
{
    union {
        struct {
            __IO  uint16_t  WTCAL                :10;
            __IO  uint16_t  RESERVED0            :6;
        };
        struct {
            __IO  uint16_t  WTCAL0               :1;
            __IO  uint16_t  WTCAL1               :1;
            __IO  uint16_t  WTCAL2               :1;
            __IO  uint16_t  WTCAL3               :1;
            __IO  uint16_t  WTCAL4               :1;
            __IO  uint16_t  WTCAL5               :1;
            __IO  uint16_t  WTCAL6               :1;
            __IO  uint16_t  WTCAL7               :1;
            __IO  uint16_t  WTCAL8               :1;
            __IO  uint16_t  WTCAL9               :1;
            __IO  uint16_t  RESERVED1            :6;
        };
    };
} stc_rtc_wtcal_field_t;

typedef struct stc_rtc_wtcalen_field
{
        __IO   uint8_t  WTCALEN                  :1;
        __IO   uint8_t  RESERVED0                :7;
} stc_rtc_wtcalen_field_t;

typedef struct stc_rtc_wtdiv_field
{
    union {
        struct {
            __IO   uint8_t  WTDIV                :4;
            __IO   uint8_t  RESERVED0            :4;
        };
        struct {
            __IO   uint8_t  WTDIV0               :1;
            __IO   uint8_t  WTDIV1               :1;
            __IO   uint8_t  WTDIV2               :1;
            __IO   uint8_t  WTDIV3               :1;
            __IO   uint8_t  RESERVED1            :4;
        };
    };
} stc_rtc_wtdiv_field_t;

typedef struct stc_rtc_wtdiven_field
{
        __IO   uint8_t  WTDIVEN                  :1;
        __IO   uint8_t  WTDIVRDY                 :1;
        __IO   uint8_t  RESERVED0                :6;
} stc_rtc_wtdiven_field_t;

typedef struct stc_rtc_wtcalprd_field
{
    union {
        struct {
            __IO   uint8_t  WTCALPRD             :6;
            __IO   uint8_t  RESERVED0            :2;
        };
        struct {
            __IO   uint8_t  WTCALPRD0            :1;
            __IO   uint8_t  WTCALPRD1            :1;
            __IO   uint8_t  WTCALPRD2            :1;
            __IO   uint8_t  WTCALPRD3            :1;
            __IO   uint8_t  WTCALPRD4            :1;
            __IO   uint8_t  WTCALPRD5            :1;
            __IO   uint8_t  RESERVED1            :2;
        };
    };
} stc_rtc_wtcalprd_field_t;

typedef struct stc_rtc_wtcosel_field
{
        __IO   uint8_t  WTCOSEL                  :1;
        __IO   uint8_t  RESERVED0                :7;
} stc_rtc_wtcosel_field_t;

/*******************************************************************************
* SBSSR_MODULE
*******************************************************************************/
typedef struct stc_sbssr_btsssr_field
{
        __IO  uint16_t  SSSR0                    :1;
        __IO  uint16_t  SSSR1                    :1;
        __IO  uint16_t  SSSR2                    :1;
        __IO  uint16_t  SSSR3                    :1;
        __IO  uint16_t  SSSR4                    :1;
        __IO  uint16_t  SSSR5                    :1;
        __IO  uint16_t  SSSR6                    :1;
        __IO  uint16_t  SSSR7                    :1;
        __IO  uint16_t  SSSR8                    :1;
        __IO  uint16_t  SSSR9                    :1;
        __IO  uint16_t  SSSR10                   :1;
        __IO  uint16_t  SSSR11                   :1;
        __IO  uint16_t  SSSR12                   :1;
        __IO  uint16_t  SSSR13                   :1;
        __IO  uint16_t  SSSR14                   :1;
        __IO  uint16_t  SSSR15                   :1;
} stc_sbssr_btsssr_field_t;

/*******************************************************************************
* SMCIF_MODULE
*******************************************************************************/
typedef struct stc_smcif_globalcontrol1_field
{
        __IO  uint16_t  PARITY                   :1;
        __IO  uint16_t  FRM0                     :1;
        __IO  uint16_t  FRM1                     :1;
        __IO  uint16_t  MODE8N1                  :1;
        __IO  uint16_t  MASKRXFUL                :1;
        __IO  uint16_t  MASKTXEMP                :1;
        __IO  uint16_t  MASKSTI                  :1;
        __IO  uint16_t  MASKCAEVENT              :1;
        __IO  uint16_t  MASKITEXP                :1;
        __IO  uint16_t  IOMOD                    :1;
        __IO  uint16_t  CKMOD                    :1;
        __IO  uint16_t  RESND                    :1;
        __IO  uint16_t  GUAEN                    :1;
        __IO  uint16_t  STIDT                    :1;
        __IO  uint16_t  IDTSC                    :1;
        __IO  uint16_t  RESERVED0                :1;
} stc_smcif_globalcontrol1_field_t;

typedef struct stc_smcif_status_field
{
        __IO  uint16_t  TXEMP                    :1;
        __IO  uint16_t  RXFUL                    :1;
        __IO  uint16_t  RXACT                    :1;
        __IO  uint16_t  TXACT                    :1;
        __IO  uint16_t  CARDDETECT               :1;
        __IO  uint16_t  CARDEVENT                :1;
        __IO  uint16_t  RECOFL                   :1;
        __IO  uint16_t  IDTRUN                   :1;
        __IO  uint16_t  RDFIFOOVR                :1;
        __IO  uint16_t  RDFIFOFUL                :1;
        __IO  uint16_t  WRFIFOEMP                :1;
        __IO  uint16_t  RXSTARTERR               :1;
        __IO  uint16_t  TXRESEND                 :1;
        __IO  uint16_t  RXRESEND                 :1;
        __IO  uint16_t  RESERVED0                :2;
} stc_smcif_status_field_t;

