mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1c1xb/common/s6e1c1xb.h
/*******************************************************************************
* MFS Registers MFS4
*   Register Definition
*******************************************************************************/
#define FM_MFS4_CSIO_SMR                          *((volatile  uint8_t*)(0x40038400UL))
#define FM0P_MFS4_CSIO_SMR                        *((volatile  uint8_t*)(0x40038400UL))
#define FM_MFS4_I2C_SMR                           *((volatile  uint8_t*)(0x40038400UL))
#define FM0P_MFS4_I2C_SMR                         *((volatile  uint8_t*)(0x40038400UL))
#define FM_MFS4_I2S_SMR                           *((volatile  uint8_t*)(0x40038400UL))
#define FM0P_MFS4_I2S_SMR                         *((volatile  uint8_t*)(0x40038400UL))
#define FM_MFS4_LIN_SMR                           *((volatile  uint8_t*)(0x40038400UL))
#define FM0P_MFS4_LIN_SMR                         *((volatile  uint8_t*)(0x40038400UL))
#define FM_MFS4_UART_SMR                          *((volatile  uint8_t*)(0x40038400UL))
#define FM0P_MFS4_UART_SMR                        *((volatile  uint8_t*)(0x40038400UL))
#define FM_MFS4_CSIO_SCR                          *((volatile  uint8_t*)(0x40038401UL))
#define FM0P_MFS4_CSIO_SCR                        *((volatile  uint8_t*)(0x40038401UL))
#define FM_MFS4_I2C_IBCR                          *((volatile  uint8_t*)(0x40038401UL))
#define FM0P_MFS4_I2C_IBCR                        *((volatile  uint8_t*)(0x40038401UL))
#define FM_MFS4_I2S_SCR                           *((volatile  uint8_t*)(0x40038401UL))
#define FM0P_MFS4_I2S_SCR                         *((volatile  uint8_t*)(0x40038401UL))
#define FM_MFS4_LIN_SCR                           *((volatile  uint8_t*)(0x40038401UL))
#define FM0P_MFS4_LIN_SCR                         *((volatile  uint8_t*)(0x40038401UL))
#define FM_MFS4_UART_SCR                          *((volatile  uint8_t*)(0x40038401UL))
#define FM0P_MFS4_UART_SCR                        *((volatile  uint8_t*)(0x40038401UL))
#define FM_MFS4_CSIO_ESCR                         *((volatile  uint8_t*)(0x40038404UL))
#define FM0P_MFS4_CSIO_ESCR                       *((volatile  uint8_t*)(0x40038404UL))
#define FM_MFS4_I2C_IBSR                          *((volatile  uint8_t*)(0x40038404UL))
#define FM0P_MFS4_I2C_IBSR                        *((volatile  uint8_t*)(0x40038404UL))
#define FM_MFS4_I2S_ESCR                          *((volatile  uint8_t*)(0x40038404UL))
#define FM0P_MFS4_I2S_ESCR                        *((volatile  uint8_t*)(0x40038404UL))
#define FM_MFS4_LIN_ESCR                          *((volatile  uint8_t*)(0x40038404UL))
#define FM0P_MFS4_LIN_ESCR                        *((volatile  uint8_t*)(0x40038404UL))
#define FM_MFS4_UART_ESCR                         *((volatile  uint8_t*)(0x40038404UL))
#define FM0P_MFS4_UART_ESCR                       *((volatile  uint8_t*)(0x40038404UL))
#define FM_MFS4_CSIO_SSR                          *((volatile  uint8_t*)(0x40038405UL))
#define FM0P_MFS4_CSIO_SSR                        *((volatile  uint8_t*)(0x40038405UL))
#define FM_MFS4_I2C_SSR                           *((volatile  uint8_t*)(0x40038405UL))
#define FM0P_MFS4_I2C_SSR                         *((volatile  uint8_t*)(0x40038405UL))
#define FM_MFS4_I2S_SSR                           *((volatile  uint8_t*)(0x40038405UL))
#define FM0P_MFS4_I2S_SSR                         *((volatile  uint8_t*)(0x40038405UL))
#define FM_MFS4_LIN_SSR                           *((volatile  uint8_t*)(0x40038405UL))
#define FM0P_MFS4_LIN_SSR                         *((volatile  uint8_t*)(0x40038405UL))
#define FM_MFS4_UART_SSR                          *((volatile  uint8_t*)(0x40038405UL))
#define FM0P_MFS4_UART_SSR                        *((volatile  uint8_t*)(0x40038405UL))
#define FM_MFS4_CSIO_RDR                          *((volatile uint16_t*)(0x40038408UL))
#define FM0P_MFS4_CSIO_RDR                        *((volatile uint16_t*)(0x40038408UL))
#define FM_MFS4_CSIO_TDR                          *((volatile uint16_t*)(0x40038408UL))
#define FM0P_MFS4_CSIO_TDR                        *((volatile uint16_t*)(0x40038408UL))
#define FM_MFS4_I2C_RDR                           *((volatile uint16_t*)(0x40038408UL))
#define FM0P_MFS4_I2C_RDR                         *((volatile uint16_t*)(0x40038408UL))
#define FM_MFS4_I2C_TDR                           *((volatile uint16_t*)(0x40038408UL))
#define FM0P_MFS4_I2C_TDR                         *((volatile uint16_t*)(0x40038408UL))
#define FM_MFS4_I2S_RDR                           *((volatile uint32_t*)(0x40038408UL))
#define FM0P_MFS4_I2S_RDR                         *((volatile uint32_t*)(0x40038408UL))
#define FM_MFS4_I2S_TDR                           *((volatile uint32_t*)(0x40038408UL))
#define FM0P_MFS4_I2S_TDR                         *((volatile uint32_t*)(0x40038408UL))
#define FM_MFS4_LIN_RDR                           *((volatile uint16_t*)(0x40038408UL))
#define FM0P_MFS4_LIN_RDR                         *((volatile uint16_t*)(0x40038408UL))
#define FM_MFS4_LIN_TDR                           *((volatile uint16_t*)(0x40038408UL))
#define FM0P_MFS4_LIN_TDR                         *((volatile uint16_t*)(0x40038408UL))
#define FM_MFS4_UART_RDR                          *((volatile uint16_t*)(0x40038408UL))
#define FM0P_MFS4_UART_RDR                        *((volatile uint16_t*)(0x40038408UL))
#define FM_MFS4_UART_TDR                          *((volatile uint16_t*)(0x40038408UL))
#define FM0P_MFS4_UART_TDR                        *((volatile uint16_t*)(0x40038408UL))
#define FM_MFS4_CSIO_BGR                          *((volatile uint16_t*)(0x4003840CUL))
#define FM0P_MFS4_CSIO_BGR                        *((volatile uint16_t*)(0x4003840CUL))
#define FM_MFS4_I2C_BGR                           *((volatile uint16_t*)(0x4003840CUL))
#define FM0P_MFS4_I2C_BGR                         *((volatile uint16_t*)(0x4003840CUL))
#define FM_MFS4_LIN_BGR                           *((volatile uint16_t*)(0x4003840CUL))
#define FM0P_MFS4_LIN_BGR                         *((volatile uint16_t*)(0x4003840CUL))
#define FM_MFS4_UART_BGR                          *((volatile uint16_t*)(0x4003840CUL))
#define FM0P_MFS4_UART_BGR                        *((volatile uint16_t*)(0x4003840CUL))
#define FM_MFS4_I2C_ISBA                          *((volatile  uint8_t*)(0x40038410UL))
#define FM0P_MFS4_I2C_ISBA                        *((volatile  uint8_t*)(0x40038410UL))
#define FM_MFS4_I2C_ISMK                          *((volatile  uint8_t*)(0x40038411UL))
#define FM0P_MFS4_I2C_ISMK                        *((volatile  uint8_t*)(0x40038411UL))
#define FM_MFS4_CSIO_FCR                          *((volatile uint16_t*)(0x40038414UL))
#define FM0P_MFS4_CSIO_FCR                        *((volatile uint16_t*)(0x40038414UL))
#define FM_MFS4_I2C_FCR                           *((volatile uint16_t*)(0x40038414UL))
#define FM0P_MFS4_I2C_FCR                         *((volatile uint16_t*)(0x40038414UL))
#define FM_MFS4_I2S_FCR                           *((volatile uint16_t*)(0x40038414UL))
#define FM0P_MFS4_I2S_FCR                         *((volatile uint16_t*)(0x40038414UL))
#define FM_MFS4_LIN_FCR                           *((volatile uint16_t*)(0x40038414UL))
#define FM0P_MFS4_LIN_FCR                         *((volatile uint16_t*)(0x40038414UL))
#define FM_MFS4_UART_FCR                          *((volatile uint16_t*)(0x40038414UL))
#define FM0P_MFS4_UART_FCR                        *((volatile uint16_t*)(0x40038414UL))
#define FM_MFS4_CSIO_FBYTE1                       *((volatile  uint8_t*)(0x40038418UL))
#define FM0P_MFS4_CSIO_FBYTE1                     *((volatile  uint8_t*)(0x40038418UL))
#define FM_MFS4_I2C_FBYTE1                        *((volatile  uint8_t*)(0x40038418UL))
#define FM0P_MFS4_I2C_FBYTE1                      *((volatile  uint8_t*)(0x40038418UL))
#define FM_MFS4_I2S_FBYTE1                        *((volatile  uint8_t*)(0x40038418UL))
#define FM0P_MFS4_I2S_FBYTE1                      *((volatile  uint8_t*)(0x40038418UL))
#define FM_MFS4_LIN_FBYTE1                        *((volatile  uint8_t*)(0x40038418UL))
#define FM0P_MFS4_LIN_FBYTE1                      *((volatile  uint8_t*)(0x40038418UL))
#define FM_MFS4_UART_FBYTE1                       *((volatile  uint8_t*)(0x40038418UL))
#define FM0P_MFS4_UART_FBYTE1                     *((volatile  uint8_t*)(0x40038418UL))
#define FM_MFS4_CSIO_FBYTE2                       *((volatile  uint8_t*)(0x40038419UL))
#define FM0P_MFS4_CSIO_FBYTE2                     *((volatile  uint8_t*)(0x40038419UL))
#define FM_MFS4_I2C_FBYTE2                        *((volatile  uint8_t*)(0x40038419UL))
#define FM0P_MFS4_I2C_FBYTE2                      *((volatile  uint8_t*)(0x40038419UL))
#define FM_MFS4_I2S_FBYTE2                        *((volatile  uint8_t*)(0x40038419UL))
#define FM0P_MFS4_I2S_FBYTE2                      *((volatile  uint8_t*)(0x40038419UL))
#define FM_MFS4_LIN_FBYTE2                        *((volatile  uint8_t*)(0x40038419UL))
#define FM0P_MFS4_LIN_FBYTE2                      *((volatile  uint8_t*)(0x40038419UL))
#define FM_MFS4_UART_FBYTE2                       *((volatile  uint8_t*)(0x40038419UL))
#define FM0P_MFS4_UART_FBYTE2                     *((volatile  uint8_t*)(0x40038419UL))
#define FM_MFS4_CSIO_SCSTR0                       *((volatile  uint8_t*)(0x4003841CUL))
#define FM0P_MFS4_CSIO_SCSTR0                     *((volatile  uint8_t*)(0x4003841CUL))
#define FM_MFS4_CSIO_SCSTR1                       *((volatile  uint8_t*)(0x4003841DUL))
#define FM0P_MFS4_CSIO_SCSTR1                     *((volatile  uint8_t*)(0x4003841DUL))
#define FM_MFS4_I2C_EIBCR                         *((volatile  uint8_t*)(0x4003841DUL))
#define FM0P_MFS4_I2C_EIBCR                       *((volatile  uint8_t*)(0x4003841DUL))
#define FM_MFS4_CSIO_SCSTR32                      *((volatile uint16_t*)(0x40038420UL))
#define FM0P_MFS4_CSIO_SCSTR32                    *((volatile uint16_t*)(0x40038420UL))
#define FM_MFS4_CSIO_SACSR                        *((volatile uint16_t*)(0x40038424UL))
#define FM0P_MFS4_CSIO_SACSR                      *((volatile uint16_t*)(0x40038424UL))
#define FM_MFS4_CSIO_STMR                         *((volatile uint16_t*)(0x40038428UL))
#define FM0P_MFS4_CSIO_STMR                       *((volatile uint16_t*)(0x40038428UL))
#define FM_MFS4_CSIO_STMCR                        *((volatile uint16_t*)(0x4003842CUL))
#define FM0P_MFS4_CSIO_STMCR                      *((volatile uint16_t*)(0x4003842CUL))
#define FM_MFS4_CSIO_SCSCR                        *((volatile uint16_t*)(0x40038430UL))
#define FM0P_MFS4_CSIO_SCSCR                      *((volatile uint16_t*)(0x40038430UL))
#define FM_MFS4_CSIO_SCSFR0                       *((volatile  uint8_t*)(0x40038434UL))
#define FM0P_MFS4_CSIO_SCSFR0                     *((volatile  uint8_t*)(0x40038434UL))
#define FM_MFS4_CSIO_SCSFR1                       *((volatile  uint8_t*)(0x40038435UL))
#define FM0P_MFS4_CSIO_SCSFR1                     *((volatile  uint8_t*)(0x40038435UL))
#define FM_MFS4_CSIO_SCSFR2                       *((volatile  uint8_t*)(0x40038438UL))
#define FM0P_MFS4_CSIO_SCSFR2                     *((volatile  uint8_t*)(0x40038438UL))
#define FM_MFS4_CSIO_TBYTE0                       *((volatile  uint8_t*)(0x4003843CUL))
#define FM0P_MFS4_CSIO_TBYTE0                     *((volatile  uint8_t*)(0x4003843CUL))
#define FM_MFS4_CSIO_TBYTE1                       *((volatile  uint8_t*)(0x4003843DUL))
#define FM0P_MFS4_CSIO_TBYTE1                     *((volatile  uint8_t*)(0x4003843DUL))
#define FM_MFS4_CSIO_TBYTE2                       *((volatile  uint8_t*)(0x40038440UL))
#define FM0P_MFS4_CSIO_TBYTE2                     *((volatile  uint8_t*)(0x40038440UL))
#define FM_MFS4_CSIO_TBYTE3                       *((volatile  uint8_t*)(0x40038441UL))
#define FM0P_MFS4_CSIO_TBYTE3                     *((volatile  uint8_t*)(0x40038441UL))

